[
	{
		"id": "0",
        "cover": "covers/resurgences.webp",
		"name": "Développeur web",
		"establishment": "Résurgences",
		"location": "Arles",
		"year": "2024-2025",
        "type": "CDD",
        "description": "Pour diversifier mes compétences, j'ai intégré Résurgences où j'ai d'abord travaillé en tant que documentaliste web, puis en tant que développeur web tout en suivant une formation pour obtenir le titre professionnel.",
        "skills": [
            "HTML",
            "CSS",
            "Javascript",
            "PHP",
            "API"                       
        ]
	},
    {
        "id": "1",
        "cover": "covers/wizama.webp",
		"name": "Développeur jeux vidéo",
		"establishment": "Wizama",
		"location": "Chateaugiron",
		"year": "2022",
        "type": "Stage",
        "description": "Stage de fin d'études de développeur jeux vidéo, j'ai réalisé l'étude et la mise en place d'une solution pour pouvoir transmettre des informations d'une console vers plusieurs téléphones avec le wifi local ou bluetooth. J'ai également modifié et amélioré un jeu existant.",
        "skills": [
            "C#",
            "Réseau",
            "Wi-Fi",
            "Bluetooth"                     
        ]
    },
    {
        "id": "2",
        "cover": "covers/ineo.webp",
		"name": "Métrologue",
		"establishment": "Engie Ineo",
		"location": "Aramon",
		"year": "2017-2018",
        "type": "Intérim",
        "description": "En Intérim, j'ai intégré l'équipe d'Ineo sur le site pharmaceutique de Sanofi à Aramon pendant un an et demi. En tant que métrologue, sur les zones de production, je récupérais les appareils de mesures et effectuais leur contrôle annuel avec un étalon en atelier. J'ai acquis une certaine rigueur et organisation.",
        "skills": [
            "Rigueur",
            "Organisation"                     
        ]
    },
    {
        "id": "3",
        "cover": "covers/dsc.webp",
		"name": "Programmeur d'automates",
		"establishment": "Division Service Climatisation",
		"location": "Arles",
		"year": "2012-2014",
        "type": "Alternance",
        "description": "J'ai effectué mon BTS en alternance chez DSC en tant que programmeur d'automates. J'ai programmé en bloc des automates. J'ai aussi pris en charge un projet complet : Développement d'un automate capable de convertir un humidificateur en hammam. J'ai également participé à plusieurs mises en service sur sites.",
        "skills": [
            "Programmation bloc",
            "Mise en service",
            "Relation client"                                 
        ]
    }
]
