[
	{
		"id": "0",
        "cover": "/covers/resurgences.webp",
		"name": "Développeur web",
		"establishment": "Résurgences",
		"location": "Arles",
		"year": "2024-2025",
        "type": "Insertion",
        "description": "A cause de difficultés pour trouver du travail en développement jeux vidéo, j'ai voulu me reconvertir dans le web, c'est là que j'ai intégré Résurgences, un chantier d'insertion dans lequel j'ai d'abord travaillé en tant que documentaliste web, puis j'ai intégré une initiation au développement web où j'ai pu apprendre les bases du développement web.",
        "skills": [
            "HTML",
            "CSS",
            "Javascript",
            "PHP",
            "API"                       
        ]
	},
    {
        "id": "1",
        "cover": "/covers/wizama.webp",
		"name": "Développeur jeux vidéo",
		"establishment": "Wizama",
		"location": "Chateaugiron",
		"year": "2022",
        "type": "Stage",
        "description": "Stage de fin d'études de développeur jeux vidéo, j'ai travaillé sur l'étude et la mise en place d'une solution pour pouvoir transmettre des informations d'une console vers plusieurs téléphones avec le wifi local ou en bluetooth. J'ai également travaillé sur des modifications apportées à un jeu existant.",
        "skills": [
            "C#",
            "Réseau",
            "Wi-Fi",
            "Bluetooth"                     
        ]
    },
    {
        "id": "2",
        "cover": "/covers/ineo.webp",
		"name": "Métrologue",
		"establishment": "Engie Ineo",
		"location": "Aramon",
		"year": "2017-2018",
        "type": "Intérim",
        "description": "En Intérim, j'ai intégré l'équipe d'Ineo sur le site pharmaceutique de Sanofi à Aramon. J'ai travaillé en tant que métrologue pendant un an et demi, le travail consistait à aller dans les zones de productions, récupérer les appareils de mesures qui n'était pas utilisé à ce moment là et de faire leur contrôle annuel avec un étalon en atelier. Cela m'a appris une certaine rigueur et organisation.",
        "skills": [
            "Rigueur",
            "Organisation"                     
        ]
    },
    {
        "id": "3",
        "cover": "/covers/dsc.webp",
		"name": "Programmeur d'automates",
		"establishment": "Division Service Climatisation",
		"location": "Arles",
		"year": "2012-2014",
        "type": "Alternance",
        "description": "Durant mon BTS en alternance, j'ai travaillé chez DSC en tant que programmeur d'automates. Cette entreprise vends des prestations de régulations de températures avec des automates de la marque Carel. J'ai programmé en bloc des automates tout en respectant les attentes des clients. J'ai également participé à plusieurs mises en service sur site.",
        "skills": [
            "Programmation bloc",
            "Mise en service",
            "Relation client"                                 
        ]
    }
]
