[
	{
		"id": "page-dynamique-js",
        "highlighted" : true,
		"name": "Créez une page web dynamique avec Javascript",
		"cover": "covers/page-dynamique.webp",		
		"desc": "Rendre une page web existante dynamique afin d'améliorer l'expérience utilisateur",
		"github": "https://github.com/Soul13890/OC_Projet_2",
        "categories": [
			"Front-end",
			"API"
        ],
        "icons": [
            "icons/html.svg",
            "icons/css.svg",
            "icons/js.svg"
        ],
        "content": {
            "context": "Dans le cadre d’un projet de formation, j’ai développé une page web dynamique pour le site d’une architecte. L’objectif était de rendre certains éléments interactifs afin d’améliorer l’expérience utilisateur et la présentation des réalisations.",
            "objectives": "Le projet visait à gérer les différents éléments du site de façon dynamique avec Javascript et à connecter la page à une API pour afficher des données réelles. Il s’agissait également de comprendre et maîtriser les requêtes HTTP nécessaires à l’échange d’informations entre le front-end et l’API.",
            "tools": "HTML, CSS et JavaScript pour la structure, le style et l’interactivité, ainsi que Swagger pour la documentation et le test de l’API.",
            "skills": "J’ai renforcé mes compétences en manipulation du DOM, en gestion d’événements et en communication avec une API REST. Les difficultés rencontrées lors des requêtes m’ont permis d’approfondir ma compréhension des paramètres et méthodes HTTP.",
            "results": "La page web est entièrement fonctionnelle, avec un affichage dynamique des projets et des filtres interactifs. Le rendu final offre une navigation fluide et met en valeur le travail de l’architecte. La page contient également un système d’authentification qui permet au client de se connecter et d’ajouter ou supprimer des travaux avec l’API grâce à une fenêtre modale",
            "ameliorations": "Je prévois d’ajouter un chargement asynchrone pour améliorer les performances et l’expérience utilisateur."
        }
	},
    {
		"id": "react-app-location",
        "highlighted" : true,
		"name": "Créez une application web de location immobilière avec React",
		"cover": "covers/react-kasa.webp",		
		"desc": "Concevoir une interface moderne et dynamique avec React",
		"github": "https://github.com/Soul13890/OC_Projet_4",
        "categories": [
			"Front-end",
			"JSON"
        ],
        "icons": [
            "icons/react.svg",
            "icons/sass.svg"
        ],
        "content": {
            "context": "Dans le cadre d’un projet de formation, j’ai réalisé une application web de location immobilière en React. Le but était de concevoir une interface moderne et dynamique, tout en respectant une architecture de composants claire et réutilisable.",
            "objectives": "L’objectif principal était d’afficher une liste de logements à partir d’un fichier JSON fourni, sans recours à une API. Le projet visait également à maîtriser la navigation entre pages et le passage de données au sein de l’application React.",
            "tools": "React pour la création des composants, React Router pour la navigation, Node.js comme environnement de développement, et Sass pour la mise en page modulable et maintenable.",
            "skills": "J’ai renforcé ma compréhension de la structure d’une application React et de la logique de communication entre composants. Les difficultés rencontrées dans le transfert de données entre pages m’ont permis d’approfondir la gestion du state et des props.",
            "results": "L’application obtenue offre une navigation fluide, un affichage clair des logements et une expérience utilisateur cohérente. Ce projet illustre ma capacité à construire une application front-end complète à partir de données statiques.",
            "ameliorations": "À terme, je souhaite intégrer une vraie API pour rendre le contenu dynamique et ajouter des filtres de recherche afin d’enrichir l’expérience utilisateur."
        }
	},
    {
		"id": "agence-voyage",
        "highlighted" : false,
		"name": "Créez la page d'accueil d'une agence de voyage avec HTML & CSS",
		"cover": "covers/agence-voyage.webp",		
		"desc": "Développement d'un site internet qui permet aux usagers de trouver des hébergements et des activités dans la ville de leur choix.",
		"github": "https://github.com/Soul13890/OC_Projet_1",
        "categories": [
			"Front-end"
        ],
        "icons": [
            "icons/html.svg",
            "icons/css.svg"
        ],
        "content": {
            "context": "Dans le cadre d’une formation, j’ai créé la page d’accueil d’une agence de voyage à partir d’une maquette Figma, avec l’enjeu de proposer une interface fidèle au design et agréable à utiliser.",
            "objectives": "L’objectif principal était de reproduire la structure et le style du prototype tout en assurant une navigation fluide et un affichage cohérent sur tous les écrans.",
            "tools": "Le développement a été réalisé en HTML et CSS, en mobilisant notamment Flexbox, Grid et des media queries pour la mise en page responsive.",
            "skills": "Ce projet m’a permis d’améliorer ma maîtrise de l’intégration web, d’affiner ma gestion du responsive design et de renforcer ma capacité à adapter une maquette en interface fonctionnelle.",
            "results": "Le livrable final respecte la maquette, ne présente aucun débordement visuel et offre une expérience utilisateur stable sur différents formats d’écran.",
            "ameliorations": "Des optimisations pourraient être apportées en ajoutant des animations légères ou en améliorant encore la modularité du code CSS."
        }
	},
    {
		"id": "opti-photo",
        "highlighted" : false,
		"name": "Débuggez et optimisez un site de photographe",
		"cover": "covers/opti-photo.webp",		
		"desc": "Optimiser le référencement d’un site, en améliorant sa performance et son accessibilité.",
		"github": "https://github.com/Soul13890/OC_Projet_3",
        "categories": [		
            "Optimisation",
            "SEO"
        ],
        "icons": [
            "icons/html.svg",
            "icons/css.svg",
            "icons/js.svg"
        ],
        "content": {
            "context": "Dans le cadre d’une formation, j'ai réalisé une démarche d’amélioration d’un site de photographe dont les performances, l’accessibilité et le référencement étaient insuffisants.",
            "objectives": "L’objectif principal était d’identifier les bugs existants, d’optimiser la vitesse de chargement et de rendre le site conforme aux bonnes pratiques d’accessibilité et de SEO.",
            "tools": "Les interventions ont été réalisées en HTML, CSS et JavaScript, avec le soutien d’outils d’audit comme W3C Validator, Lighthouse, Wave et Google Rich Results.",
            "skills": "Ce projet m’a permis de renforcer mes compétences en débogage, en analyse de performances et en optimisation technique orientée utilisateur et moteur de recherche.",
            "results": "Les corrections ont amélioré la stabilité du site, augmenté ses scores Lighthouse et assuré une meilleure lisibilité pour les outils de référencement.",
            "ameliorations": "Les prochaines étapes pourraient inclure une refonte partielle du code pour encore plus de modularité et l’ajout de tests automatisés pour prévenir les régressions."
        }
	},
    {
		"id": "backend-livre",
        "highlighted" : false,
		"name": "Développez le back-end d'un site de notation de livres",
		"cover": "covers/backend-livre.webp",		
		"desc": "Développement de la partie serveur d’une application permettant aux utilisateurs de consulter, noter et ajouter des livres.",
		"github": "https://github.com/Soul13890/OC_Projet_5",
        "categories": [		
            "Back-end"            
        ],
        "icons": [
            "icons/express.svg",
            "icons/nodejs.svg",
            "icons/mongodb.svg"
        ],
        "content": {
            "context": "Dans le cadre d’une formation, j'ai bâti l’infrastructure back-end d’un site de notation de livres, un domaine encore nouveau pour moi, ce qui représentait un véritable enjeu d’apprentissage.",
            "objectives": "L’objectif était de concevoir une API fiable permettant la gestion sécurisée des utilisateurs, des livres et des notations, tout en garantissant une architecture claire et évolutive.",
            "tools": "Le développement a été réalisé avec Node.js, Express et MongoDB, technologies utilisées pour créer les routes, gérer la base de données et structurer la logique métier.",
            "skills": "Ce projet m’a permis de m’adapter rapidement à Express, de comprendre les bases de la conception d’API REST et de renforcer ma maîtrise des opérations CRUD.",
            "results": "L’API développée est fonctionnelle, sécurisée et conforme aux besoins du projet, permettant un échange fluide de données entre le front-end et le serveur.",
            "ameliorations": "Une amélioration intéressante consisterait à ajouter un système de gestion des permissions (rôles utilisateurs) pour mieux contrôler l’accès à certaines fonctionnalités."
        }
	},
    {
		"id": "planif-projet",
        "highlighted" : false,
		"name": "Planifiez le développement du site de votre client",
		"cover": "covers/planif-projet.webp",		
		"desc": "Planifier le développement complet d’un site web, en définissant les étapes de production et l’organisation du travail.",
		"github": "",
        "categories": [		
            "Planification",
            "Kanban"            
        ],
        "icons": [
            "icons/trello.svg",
            "icons/word.svg",
            "icons/feedly.svg"
        ],
        "content": {
            "context": "Dans le cadre d’une formation, j’ai été chargé de planifier le développement complet d’un site web, en définissant les étapes de production et l’organisation du travail. L’enjeu principal était d’assurer une vision structurée du projet pour garantir une réalisation fluide et cohérente.",
            "objectives": "L’objectif était de formaliser les besoins du client, d’anticiper les tâches techniques et d’optimiser la gestion du temps grâce à une organisation claire. Il s’agissait également de prévenir les risques et d’assurer un cadre de production reproductible pour de futurs projets.",
            "tools": "J’ai utilisé un tableau Kanban sur Trello pour organiser les tâches, un document de spécifications techniques détaillé, ainsi qu’un système de veille basé sur des outils comme Feedly, GitHub Trends ou des newsletters spécialisées.",
            "skills": "Ce projet m’a permis de renforcer ma capacité d’analyse, de structuration et de priorisation des besoins techniques. J’ai également développé une méthodologie de veille efficace pour suivre les évolutions du secteur.",
            "results": "Le projet a abouti à une documentation claire comprenant un Kanban opérationnel et des spécifications techniques complètes, offrant au client une vision transparente du déroulement du développement. Cette préparation a permis d’améliorer la coordination et de réduire les zones d’incertitude en amont.",
            "ameliorations": "Les prochaines étapes consistent à automatiser certains process (modèles de tickets, checklists) et à enrichir la veille avec des outils de monitoring plus avancés pour anticiper encore mieux les choix techniques."
        }
	},
    {
		"id": "verrerie",
        "highlighted" : true,
		"name": "Créez une page web reliée à une station météo",
		"cover": "covers/verrerie.webp",		
		"desc": "Afficher les informations d'une station météo Raspberry Pi",
		"github": "",
        "categories": [
			"Front-end"
        ],
        "icons": [
            "icons/html.svg",
            "icons/css.svg",
            "icons/bootstrap.svg"
        ],
        "content": {
            "context": "Dans le cadre d’un projet d’équipe, j’ai travaillé comme lead developper sur la création d’une page web destinée à afficher les données d’une station météo Raspberry Pi. L’enjeu principal était de proposer une interface simple, lisible et fiable pour consulter les informations transmises par le dispositif.",
            "objectives": "Notre mission consistait à concevoir une page web responsive et facile à maintenir, tout en testant plusieurs approches d’affichage pour retenir la plus pertinente. Il s’agissait également d’assurer une intégration propre avec les données fournies par le système existant.",
            "tools": "HTML, CSS, Bootstrap pour l’interface, intégration des données transmises par un script Python externe géré par le client.",
            "skills": "Ce projet m’a permis de renforcer mes compétences en conception d’interface, en organisation itérative et en décision technique. En tant que lead programmer, j’ai aussi développé ma capacité à coordonner l’avancement et à garantir la cohérence du rendu final.",
            "results": "Le livrable final est une interface claire, stable et exploitable, validée lors de tests internes pour sa lisibilité et sa compatibilité multi-supports. L’ensemble respecte les attentes du client tout en restant facilement extensible.",
            "ameliorations": "Nous sommes actuellement en attente des directives du client pour intégrer une gestion des événements du lieu-dit, avec système de connexion utilisateur et formulaire dédié à l’ajout d’événements."
        }
	}
]
