[
	{
		"id": "page-dynamique-js",
		"name": "Créez une page web dynamique avec Javascript",
		"cover": "covers/page-dynamique.webp",		
		"desc": "Rendre une page web existante dynamique afin d'améliorer l'expérience utilisateur",
		"github": "https://github.com/Soul13890/OC_Projet_2",
        "categories": [
			"Front-end",
			"API"
        ],
        "icons": [
            "icons/html.svg",
            "icons/css.svg",
            "icons/js.svg"
        ],
        "content": {
            "context": "Dans le cadre d’un projet de formation, j’ai développé une page web dynamique pour le site d’une architecte. L’objectif était de rendre certains éléments interactifs afin d’améliorer l’expérience utilisateur et la présentation des réalisations.",
            "objectives": "Le projet visait à gérer les différents éléments du site de façon dynamique avec Javascript et à connecter la page à une API pour afficher des données réelles. Il s’agissait également de comprendre et maîtriser les requêtes HTTP nécessaires à l’échange d’informations entre le front-end et l’API.",
            "tools": "HTML, CSS et JavaScript pour la structure, le style et l’interactivité, ainsi que Swagger pour la documentation et le test de l’API.",
            "skills": "J’ai renforcé mes compétences en manipulation du DOM, en gestion d’événements et en communication avec une API REST. Les difficultés rencontrées lors des requêtes m’ont permis d’approfondir ma compréhension des paramètres et méthodes HTTP.",
            "results": "La page web est entièrement fonctionnelle, avec un affichage dynamique des projets et des filtres interactifs. Le rendu final offre une navigation fluide et met en valeur le travail de l’architecte. La page contient également un système d’authentification qui permet au client de se connecter et d’ajouter ou supprimer des travaux avec l’API grâce à une fenêtre modale",
            "ameliorations": "Je prévois d’ajouter un chargement asynchrone pour améliorer les performances et l’expérience utilisateur."
        }
	},
    {
		"id": "react-app-location",
		"name": "Créez une application web de location immobilière avec React",
		"cover": "covers/react-kasa.webp",		
		"desc": "Concevoir une interface moderne et dynamique avec React",
		"github": "https://github.com/Soul13890/OC_Projet_4",
        "categories": [
			"Front-end",
			"JSON"
        ],
        "icons": [
            "icons/react.svg",
            "icons/sass.svg"
        ],
        "content": {
            "context": "Dans le cadre d’un projet de formation, j’ai réalisé une application web de location immobilière en React. Le but était de concevoir une interface moderne et dynamique, tout en respectant une architecture de composants claire et réutilisable.",
            "objectives": "L’objectif principal était d’afficher une liste de logements à partir d’un fichier JSON fourni, sans recours à une API. Le projet visait également à maîtriser la navigation entre pages et le passage de données au sein de l’application React.",
            "tools": "React pour la création des composants, React Router pour la navigation, Node.js comme environnement de développement, et Sass pour la mise en page modulable et maintenable.",
            "skills": "J’ai renforcé ma compréhension de la structure d’une application React et de la logique de communication entre composants. Les difficultés rencontrées dans le transfert de données entre pages m’ont permis d’approfondir la gestion du state et des props.",
            "results": "L’application obtenue offre une navigation fluide, un affichage clair des logements et une expérience utilisateur cohérente. Ce projet illustre ma capacité à construire une application front-end complète à partir de données statiques.",
            "ameliorations": "À terme, je souhaite intégrer une vraie API pour rendre le contenu dynamique et ajouter des filtres de recherche afin d’enrichir l’expérience utilisateur."
        }
	},
    {
		"id": "verrerie",
		"name": "Créez une page web reliée à une station météo",
		"cover": "covers/verrerie.webp",		
		"desc": "Afficher les informations d'une station météo Raspberry Pi",
		"github": "",
        "categories": [
			"Front-end"
        ],
        "icons": [
            "icons/html.svg",
            "icons/css.svg",
            "icons/bootstrap.svg"
        ],
        "content": {
            "context": "Dans le cadre d’un projet d’équipe, j’ai travaillé comme lead developper sur la création d’une page web destinée à afficher les données d’une station météo Raspberry Pi. L’enjeu principal était de proposer une interface simple, lisible et fiable pour consulter les informations transmises par le dispositif.",
            "objectives": "Notre mission consistait à concevoir une page web responsive et facile à maintenir, tout en testant plusieurs approches d’affichage pour retenir la plus pertinente. Il s’agissait également d’assurer une intégration propre avec les données fournies par le système existant.",
            "tools": "HTML, CSS, Bootstrap pour l’interface, intégration des données transmises par un script Python externe géré par le client.",
            "skills": "Ce projet m’a permis de renforcer mes compétences en conception d’interface, en organisation itérative et en décision technique. En tant que lead programmer, j’ai aussi développé ma capacité à coordonner l’avancement et à garantir la cohérence du rendu final.",
            "results": "Le livrable final est une interface claire, stable et exploitable, validée lors de tests internes pour sa lisibilité et sa compatibilité multi-supports. L’ensemble respecte les attentes du client tout en restant facilement extensible.",
            "ameliorations": "Nous sommes actuellement en attente des directives du client pour intégrer une gestion des événements du lieu-dit, avec système de connexion utilisateur et formulaire dédié à l’ajout d’événements."
        }
	}
]
